; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image4 - mode
	image0 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	Star0 - direction
	Star3 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star7 - direction
	Star6 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 image4)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star6)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument4 image4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image4)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star6)
	(supports instrument7 image0)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 Star7)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(have_image Planet9 image4)
	(have_image Planet10 thermograph1)
	(have_image Planet11 image0)
	(have_image Star12 image0)
	(have_image Star13 image0)
	(have_image Star14 thermograph1)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 7
2. (calibrate satellite3 instrument7 star6)
   added: (calibrated instrument7)
   goals met: 0 of 7
3. (turn_to satellite3 planet11 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet11)
   goals met: 0 of 7
4. (take_image satellite3 planet11 instrument7 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 7
5. (turn_to satellite3 planet10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet10)
   goals met: 1 of 7
6. (take_image satellite3 planet10 instrument7 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
8. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 7
9. (turn_to satellite0 planet9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet9)
   goals met: 2 of 7
10. (take_image satellite0 planet9 instrument0 image4)
   added: (have_image planet9 image4)
   goals met: 3 of 7
11. (turn_to satellite0 groundstation8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation8)
   goals met: 4 of 7
12. (turn_to satellite3 star12 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star12)
   goals met: 4 of 7
13. (take_image satellite3 star12 instrument7 image0)
   added: (have_image star12 image0)
   goals met: 5 of 7
14. (turn_to satellite3 star13 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star13)
   goals met: 5 of 7
15. (take_image satellite3 star13 instrument7 image0)
   added: (have_image star13 image0)
   goals met: 6 of 7
16. (turn_to satellite3 star14 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star14)
   goals met: 6 of 7
17. (take_image satellite3 star14 instrument7 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 7 of 7
